# InvalidNumberOfMechanicalEquipmentOnDuty Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..InvalidNumberOfMechanicalEquipmentOnDuty Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
The number of on duty equipment must be less than or equal to the number of available equipments.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidNumberOfMechanicalEquipmentOnDuty { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidNumberOfMechanicalEquipmentOnDuty As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidNumberOfMechanicalEquipmentOnDuty {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace